[
 {
  "name": "Statement of project’s context, aims and objectives",
  "description": "To what extent are the problem topic and investigation well framed in the report? How challenging is the problem demonstrated to be?",
  "compulsory": false,
  "weight": 2,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "No statement or very generalised with vague aims or objectives. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Problem area outlined but insufficiently clear aims and objectives."
   },
   {
    "upTo": 49,
    "positives": "Problem topic and aims and objectives apparent.",
    "negatives": "But shows limited understanding and analysis."
   },
   {
    "upTo": 59,
    "positives": "Problem topic and aims and objectives well presented, showing understanding and analysis. Key aspects of the context are covered.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Problem topic and aims and objectives well framed and viewed in wider context.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Problem is clearly shown to be challenging OR shows originality and confidence in criticising assumptions.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Challenging problem, AND tackled with originality and confidence.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Critical review of relevant literature",
  "description": "How critical, relevant, comprehensive and current is the review? Are the sources demonstrated to be credible (or not)? Does the review incorporate all the relevant literature? Is irrelevant material left out?",
  "compulsory": false,
  "weight": 2,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Zero or a few sources mentioned, but not reviewed. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Superficial review, misunderstanding the subject."
   },
   {
    "upTo": 49,
    "positives": "Some research using texts, Internet and key reference sources with reference citation and presentation according to convention.",
    "negatives": "Limited understanding and analysis."
   },
   {
    "upTo": 59,
    "positives": "Research uses primary sources.  Appropriately cited and presented references.  Shows some understanding and analysis.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Well researched and presented.  Demonstrates understanding and viewed in wider context.  Uses credible, current material.  Shows some originality of thought with good critique.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Evidence of extensive research.  Demonstrates understanding of complex subject.  Shows originality and confidence in criticising assumptions.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Well-justified critique of literature.  Identifies flaws, gaps or inconsistencies in extant knowledge.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Methodological approach",
  "description": "To what extent does the report show that the methods used were appropriate, justified and well applied? How well does the report describe and justify appropriate methodological tools\/techniques deployed or considered for deployment?",
  "compulsory": false,
  "weight": 1,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Little\/no evidence of choice or use of method or life cycle. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Poor choice of methodology and life cycle, or little\/no evidence of use."
   },
   {
    "upTo": 49,
    "positives": "Methodology and\/or life cycle described.  Some evidence of use.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Appropriate methodology and life cycle used.  Some justification for use.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Credible justification for use.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Methodology well described, well applied and well justified.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Innovative aspects to methodology or application.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Specification and discussion of the requirements",
  "description": "How well does the report describe and justify how the specification of the problem and its solution were arrived at? Does the report describe and explain the important requirements (and why they are important)? Are the requirements complete and consistent? Has the client approved them (implicitly or explicitly)?",
  "compulsory": true,
  "weight": 3,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "No discernable requirements. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Requirements are vague, unclear or disjointed."
   },
   {
    "upTo": 49,
    "positives": "Partial statement of requirements. Some limited indication of how they were arrived at.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Full or nearly full statement of requirements.  Discussion of requirements and some analysis.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Relative importance of requirements is stated and justified.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Requirements complete and consistent, well-conducted analysis.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Adds some new insight into requirements specification.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Analysis and discussion of the IT design",
  "description": "How well does the report demonstrate how the solution was designed including design method(s), design process(es) and outcome(s) in areas such as system architectures, databases, user interfaces, interfaces to other systems, and other areas of IT?",
  "compulsory": true,
  "weight": 3,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "No discernible design. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Poor use of design methods, with little\/no justification.  Design not adequately explained."
   },
   {
    "upTo": 49,
    "positives": "Some evidence of design.  Some explanation of methods, processes and outcomes.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Some justification of design decisions, for the significant areas of development.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Good justification of design decisions  for most areas of development.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Full justification and critique of design decisions in all areas.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Adds some new insight into design and\/or methodology.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Discussion of implementation",
  "description": "How well does the report describe and justify the decisions and trade-offs made, such as selection of algorithms, data structures, usability and implementation environments as appropriate?",
  "compulsory": true,
  "weight": 3,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Little\/no description of implementation. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Superficial description of implementation."
   },
   {
    "upTo": 49,
    "positives": "Description of implementation without much justification or reflection, or good command of techniques \/ tools.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Some justification of implementation decisions made, or good command of techniques \/ tools used.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Good justification of implementation decisions  OR evidence of problem solving.  Good command of techniques \/ tools used.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Thorough justification of implementation decisions made AND evidence of problem solving.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Adds new insight into implementation OR provides guide to avoiding similar problems.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Discussion of verification and validation",
  "description": "How well does the report describe and justify the approach(es) to verification and validation at each stage of the project, including testing and debugging?",
  "compulsory": false,
  "weight": 1,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Little\/no evidence of testing or debugging having been carried out. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Superficial description of testing and debugging."
   },
   {
    "upTo": 49,
    "positives": "Description of testing and debugging carried out.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Some justification of approaches used for testing and debugging.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Good justification of approaches used in most areas.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Shows that tests were well planned and fully carried out OR Critical discussion of results and remedial actions taken.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Tests well planned AND critical discussion.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Evaluation against requirements",
  "description": "How well does the report describe and justify the means by which the outcome of the project was evaluated? How well is it shown whether the specification of the requirements has been satisfied? How well explained are areas where it hasn’t?",
  "compulsory": true,
  "weight": 2,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Little\/no evidence of evaluation having been planned or carried out. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Some superficial evaluation carried out, but without evidence of planning or purpose."
   },
   {
    "upTo": 49,
    "positives": "Description of plan for evaluating outcome.  Some evidence that outcome meets requirements.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Evidence that artefact meets requirements with explanation where it doesn’t.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Justification of evaluation method.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Convincing evidence that project meets its objectives or explanation where it doesn’t OR Shows awareness of limits of evaluation.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Convincing evidence AND awareness of limits.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Evidence of project planning and management",
  "description": "How well does the report demonstrate the preparation of an overall project plan with time-scales, resources, and a work schedule? How well does the report show evidence that it has been followed and explain deviations from it? Has an appropriate project management methodology been adopted?",
  "compulsory": false,
  "weight": 1,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "No management of project evident. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Sketchy generalised plan with no evidence of monitoring of progress."
   },
   {
    "upTo": 49,
    "positives": "Project plan with some evidence that it has been followed.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Some detail in plan.  Evidence that it has been followed.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Shows a detailed plan with timescales, resources and a work schedule for most tasks.  Some evaluation of progress against plan.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Demonstrates understanding of issues that affected the project and how they could have been avoided.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Develops novel and well-justified approach to project planning and management.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Attributes of the solution",
  "description": "Based on the demonstration of the artefact(s) and\/or the evidence of the artefact(s) presented in the report or its appendices, how well do they show the quality of the artefact(s), e.g. attributes such as reliability, timeliness, maintainability, completeness, and consistency? An artefact may be a piece of software, hardware or a detailed design for one.",
  "compulsory": false,
  "weight": 5,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Artefact is substantially incomplete. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Artefact does not work or meets few of the requirements that could reasonably expected to be met in the time available."
   },
   {
    "upTo": 49,
    "positives": "",
    "negatives": "Artefact implements minimum functionality compared with expectation or has significant bugs."
   },
   {
    "upTo": 59,
    "positives": "Artefact implements most of the requirements with only minor bugs.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Artefact is reasonably complete and free of significant defects.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Artefact exhibits good qualities of reliability, timeliness, maintainability, completeness and consistency.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Artefact meets all (or virtually all) of its requirements OR Artefact is worthy of real use and\/or distribution.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Summary, conclusions and recommendations",
  "description": "To what extent are the conclusions and recommendations appropriate, original and supported by the report? How well are the outcomes of the project summarised? Are the conclusions based on analysis and understanding rather than being trite?",
  "compulsory": false,
  "weight": 2,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "No serious attempt made to address the question or problem and\/or shows a serious misunderstanding of the requirements of the task. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Work attempts to address the question\/problem but is substantially incomplete and deficient."
   },
   {
    "upTo": 49,
    "positives": "",
    "negatives": "Some summary or statement of conclusions, but the conclusions are trite or somewhat irrelevant to the problem being addressed."
   },
   {
    "upTo": 59,
    "positives": "Outcomes summarised.  Conclusions mostly valid and related at least partially to the objectives.  Some recommendations made.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Conclusions all valid and relate well to all the objectives.  Recommendations are valid with some justification.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Demonstrates understanding of complex topic and places it in wider context.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Conclusions appropriate, original and supported by the report.  Excellent summary of project and insightful conclusions.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Structure and presentation",
  "description": "How well presented is the report in terms of quality of prose style; page layout; appropriate division into chapters, sections and sub-sections; use of graphics and tables; punctuation, spelling, grammar and syntax; ease of reading; enjoyability of reading?",
  "compulsory": false,
  "weight": 2,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "Acutely deficient in all aspects. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "Serious problems with a number of aspects of language use are often found in work in this range."
   },
   {
    "upTo": 49,
    "positives": "An attempt to follow directions regarding organisation, structure, use and flow of language, grammar, spelling, format, diagrams, tables etc.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Satisfactory presentation with respect to organisation, language, grammar, spelling, format, presentation, diagrams, tables etc.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Very good in terms of organisation, structure, use and flow of language, grammar, spelling, format, presentation, diagrams, tables etc.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Excellent in terms of organisation, structure, use and flow of language, grammar, spelling, format, presentation, diagrams, tables etc.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Outstanding quality in terms of organisation, structure, use and flow of language, grammar, spelling, format, presentation, diagrams, tables etc.",
    "negatives": ""
   }
  ]
 },
 {
  "name": "Overall understanding and reflection",
  "description": "In all categories, does the report show clearly and explicitly that the student has understood the material presented and the techniques used? Does the student demonstrate appreciation of the strengths and weaknesses of the approach(es) used?",
  "compulsory": false,
  "weight": 3,
  "levels": [
   {
    "upTo": 29,
    "positives": "",
    "negatives": "FAIL. No serious attempt to address the question or problem, and\/or manifests a serious misunderstanding of the requirements of the assignment. Acutely deficient in all aspects. 20-29 indicates a superficial, cursory or casual approach. 10-19 indicates an unintelligible, meaningless or indecipherable report. 1-9 indicates little or no evidence of any work being done. 0 is reserved for non-submission."
   },
   {
    "upTo": 39,
    "positives": "",
    "negatives": "FAIL. Anything, which is inadequate in most or all of the following: length, content, structure, analysis, expression, argument, relevance, research and presentation. Work in this range attempts to address the question \/ problem but is substantially incomplete and deficient."
   },
   {
    "upTo": 49,
    "positives": "Adequate work which attempts to address the topic with limited understanding and analysis.",
    "negatives": ""
   },
   {
    "upTo": 59,
    "positives": "Work that attempts to address the topic with some understanding and analysis, key aspects of the subject matter covered.  The majority of students might normally be expected to fall within this range.",
    "negatives": ""
   },
   {
    "upTo": 69,
    "positives": "Very good work – contains most of the information required, is accurate and relevant and demonstrates understanding of the subject matter and attempts to view it in a wider context. Shows some originality of thought with good critique and analysis of assumptions, is aware of the limits of knowledge.",
    "negatives": ""
   },
   {
    "upTo": 79,
    "positives": "Outstanding work.  Contains accurate, relevant material, demonstrates understanding of complex subject matter and is able to view it in a wider context.  Shows originality and confidence in analysing and criticising assumptions.  Is aware of the limits of knowledge.",
    "negatives": ""
   },
   {
    "upTo": 100,
    "positives": "Likely to add new insights to the topic.  Approaches the quality of published material.",
    "negatives": ""
   }
  ]
 }
]
